gpsmark_api/app/controllers/places_controller.rb

SELECT "places".* FROM "places" WHERE "places"."user_id" = $1  [["user_id", 2]]
---
  def show
    @places = Place.where(user_id: params[:id])

INSERT INTO "places" ("nick_name", "addrees", "img", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["nick_name", "mi casa 5"], ["addrees", "3333 Buford Dr, Buford, GA 30519"], ["img", ""], ["created_at", "2020-08-05 01:23:22.575371"], ["updated_at", "2020-08-05 01:23:22.575371"], ["user_id", 1]]
---
  def create
    @place = Place.new(place_params)
    @place.user_id = params[:user_id]

    if @place.save

UPDATE "places" SET "addrees" = $1, "updated_at" = $2 WHERE "places"."id" = $3  [["addrees", "3333 Buford Dr, Buford, GA 30519"], ["updated_at", "2020-08-05 04:23:14.851542"], ["id", 18]]
---
  def update
    if @place.update(place_params)