gpsmark_api/app/controllers/users_controller.rb

INSERT INTO "users" ("user", "password", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user", "mi casa"], ["password", "2020st "], ["created_at", "2020-07-31 00:26:09.912876"], ["updated_at", "2020-07-31 00:26:09.912876"]]
---
  def create
    @user = User.new(user_params)

    if @user.save